module Conj (Conj, klass) where

data Conj = Add | Cont | Cause | Appose | Converse | Exemp | Other deriving Show

klass w
  | w `elem` adds = Add
  | w `elem` conts = Cont
  | w `elem` causes = Cause
  | w `elem` apposes = Appose
  | w `elem` converses = Converse
  | w `elem` exemps = Exemp
  | otherwise = Other

adds = [ "また" , "又" , "亦" , "そして" , "それに" , "しかも" , "さらに" , "それから" , "そのうえ" , "そのうえに" , "それと" , "おまけに" , "ちなみに" , "因みに" , "なお" , "尚" , "なぜなら" , "ただし" , "但し" , "ただし" , "但" , "かつ" , "とどうじに" , "と同時に" , "あわせて" , "併せて" , "おなじく" , "同じく" , "それも" , "ましてや" , "それどころか" , "どころか" , "ついで" , "次いで" , "ならびに" , "まずは" , "つぎに" , "次に" , "そのうえで" , "だとすれば" , "とすれば" , "ほな" , "ほなら" , "ほんなら" , "そういや" , "そういえば" , "そーいや" , "それだけに" , "だって" , "というのも" , "じつは" , "実は" , "ほんとうは" , "本当は" , "もっとも" , "尤も" , "ともすれば" , "そもそも" , "じゃ" , "んじゃ" , "しかしながら" , "然しながら" , "然し乍ら" , "それだけに" , "つまるところ" , "そうですが"]
conts = [ "しかし" , "然し" , "でも" , "ところが" , "だが" , "ですけれど" , "しかしながら" , "然し乍ら" , "然しながら" , "けれども" , "けれど" , "ですが" , "それでも" , "じゃが" , "だけど" , "されど" , "が" , "けど" , "そうですが" , "だけれども" , "だからといって" , "さりとて" , "なのに" , "それなのに" , "にもかかわらず" , "さもなければ" , "でないと" , "いな" , "いや" , "否" , "いえ" , "じつは" , "実は" , "本当は" , "ほんとうは" , "そもそも" , "だからといって" , "はんめん" , "反面" , "そうですが" , "ぎゃくに" , "逆に" , "でなければ" , "てゆーか" , "てか" , "ってか"]
causes = ["なので" , "だから" , "ですから" , "ゆえに" , "故に" , "ほんで" , "そこで" , "そやさかい" , "そると" , "だとすると" , "そうなると" , "そうすると" , "だとすれば" , "とすれば" , "だからこそ" , "それでも" , "かくして" , "こうして" , "そうして" , "で" , "それだけに" , "したがって" , "従って" , "よって" , "それから" , "そうしたら" , "したら" , "そしたら" , "では" , "じゃ" , "んじゃ" ]
apposes = ["または" , "又は" , "あるいは" , "或いは" , "或は" , "もしくは" , "若しくは" , "それとも" , "ないし" , "乃至" , "つまり" , "すなわち" , "即ち" , "一方" , "かたや" , "および" , "及び" , "ないしは" , "ならびに" , "並びに" , "それから" , "それでいて" , "したがって" , "従って" , "よって" , "てゆーか" , "てか" , "ってか" ]
converses = [ "では" , "それでは" , "ところで" , "さて" , "それじゃ" , "じゃあ" , "ふんじゃ" , "ほんじゃ" , "んじゃ" , "じゃ" , "ほんなら" , "ほな" , "ほなら" , "それにしても" , "ともあれ" , "さあ" , "そうしたら" , "したら" , "そしたら" , "ならば" , "ならば" , "それなら" , "てゆーか" , "てか" , "ってか" , "そういや" , "そういえば" , "そーいや" ]
exemps = [ "たとえば" , "例えば" , "譬えば" , "たとへば" , "例へば" , "譬へば"]
